AUTO_config_TK_pesok/src/DataProcessors/ТК_МиксерБухУчетТоваров/ТК_МиксерБухУчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_МиксерБухУчетТоваров</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/AccumulationRegisters/ПотребностиОрганизаций/ПотребностиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностиОрганизаций</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <comment>Количественный остаток товара на складе в разрезе партий</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/ОстаткиОрганизации/ОстаткиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиОрганизации</name>
  <resources>
    <name>Количество</name>
    <comment>Количественный остаток</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте регламентированного учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <type>
      <types>EnumRef.СтатусыПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ТипыПартий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_АналитикаУчетаНоменклатурыОрганизаций/ТК_АналитикаУчетаНоменклатурыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_АналитикаУчетаНоменклатурыОрганизаций</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.ТК_КлючиАналитикиУчетаНоменклатурыОрганизаций</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/ВидыПоследовательности/ВидыПоследовательности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПоследовательности</name>
  <enumValues>
    <name>ПартииТоваров</name>
  </enumValues>
  <enumValues>
    <name>Взаиморасчеты</name>
  </enumValues>
  <enumValues>
    <name>ПартииОрганизаций</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/DataProcessors/ТК_МиксерБухУчетТоваров/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьГраницу(ТаблицаОрганизаци)
	
	
	Для Каждого СтрОр Из ТаблицаОрганизаци Цикл                                                  
		Момент =   УправлениеПоследовательностями.ПолучитьГраницуПоследовательности(Перечисления.ВидыПоследовательности.ПартииОрганизаций,СтрОр.Организация);
		
		ЗаписьПоСтроке = Строка(СтрОр.Организация)+" гп."  + ?(Момент.Дата = '00010101',"н/у",Формат(Момент.Дата,"ДФ='dd.MM.yyyy ЧЧ:мм:сс'"));
		СтрОр.ЗаписьПоСтроке = ЗаписьПоСтроке;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастроек  = ХранилищаНастроек.НайстройкиФорм.Загрузить(Метаданные.Обработки.ТК_МиксерБухУчетТоваров.Имя,"Миксер",,ИмяПользователя());

	Если СтруктураНастроек <> Неопределено Тогда
		мОрганизации.Загрузить(СтруктураНастроек.мОрганизации);	
		Если СтруктураНастроек.Свойство("ОрганизацияСписания") Тогда
			ТекОрганизацияСписания = СтруктураНастроек.ОрганизацияСписания;

			Элементы.ДекорацияТекОрганизацияОстатки.Заголовок = Строка(ТекОрганизацияСписания);

		КонецЕсли;

	КонецЕсли;
	
	ЗаполнитьГраницу(мОрганизации);
	ФильтрПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
//	Элементы.ГруппаСтраницыМастер.Видимость = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Устанавливаем текущую таблицу переходов.
	ТаблицаПереходовПоСценарию1();
	
	// Позиционируемся на первом шаге помощника.
	УстановитьПорядковыйНомерПерехода(1);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекстПредупреждения = НСтр("ru = 'Закрыть обработку формирования документов?'");
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(
		ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, "ЗакрытьФормуБезусловно");

КонецПроцедуры


&НаКлиенте
Процедура ТекОрганизацияСписанияПриИзменении(Элемент)
	
	Элементы.ДекорацияТекОрганизацияОстатки.Заголовок = Строка(ТекОрганизацияСписания);

КонецПроцедуры



&НаСервере
Процедура ВыполнитьФормированиеОстатковНаСервере()
	//
	//// Имитация продолжительного действия (5 сек.).
	//ДатаНачалаОперации = ТекущаяДатаСеанса();
	//Пока ТекущаяДатаСеанса() - ДатаНачалаОперации < 5 Цикл
	//КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПотребностиОрганизацийОбороты.АналитикаУчета КАК АналитикаУчета,
		|	ПотребностиОрганизацийОбороты.КоличествоОборот КАК КоличествоОборот
		|ПОМЕСТИТЬ ВТ_Потребность
		|ИЗ
		|	РегистрНакопления.ПотребностиОрганизаций.Обороты(&НачалоПериода, &КонецПериода, , АналитикаУчета.Организация = &Организация) КАК ПотребностиОрганизацийОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиОрганизацииОстатки.АналитикаУчета КАК АналитикаУчета,
		|	ОстаткиОрганизацииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ДоступныеОстатки
		|ИЗ
		|	РегистрНакопления.ОстаткиОрганизации.Остатки(
		|			&КонецПериода,
		|			АналитикаУчета В
		|				(ВЫБРАТЬ
		|					ТК_АналитикаУчетаНоменклатурыОрганизаций.КлючАналитики КАК КлючАналитики
		|				ИЗ
		|					РегистрСведений.ТК_АналитикаУчетаНоменклатурыОрганизаций КАК ТК_АналитикаУчетаНоменклатурыОрганизаций
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Потребность КАК ВТ_Потребность
		|						ПО
		|							ТК_АналитикаУчетаНоменклатурыОрганизаций.Номенклатура = ВТ_Потребность.АналитикаУчета.Номенклатура
		|								И ТК_АналитикаУчетаНоменклатурыОрганизаций.ХарактеристикаНоменклатуры = ВТ_Потребность.АналитикаУчета.ХарактеристикаНоменклатуры
		|								И ТК_АналитикаУчетаНоменклатурыОрганизаций.Организация = &ОрганизацияОстатков)) КАК ОстаткиОрганизацииОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.АналитикаУчета КАК Аналитика,
		|	ВложенныйЗапрос.Потребность КАК Потребность,
		|	ВложенныйЗапрос.Остаток КАК Остаток,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Остаток >= ВложенныйЗапрос.Потребность
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выбран
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Потребность.АналитикаУчета КАК АналитикаУчета,
		|		СУММА(ВТ_Потребность.КоличествоОборот) КАК Потребность,
		|		СУММА(ЕСТЬNULL(ВТ_ДоступныеОстатки.КоличествоОстаток, 0)) КАК Остаток
		|	ИЗ
		|		ВТ_Потребность КАК ВТ_Потребность
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоступныеОстатки КАК ВТ_ДоступныеОстатки
		|			ПО ВТ_Потребность.АналитикаУчета.Номенклатура = ВТ_ДоступныеОстатки.АналитикаУчета.Номенклатура
		|				И ВТ_Потребность.АналитикаУчета.ХарактеристикаНоменклатуры = ВТ_ДоступныеОстатки.АналитикаУчета.ХарактеристикаНоменклатуры
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТ_Потребность.АналитикаУчета) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("КонецПериода", ФильтрПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", ФильтрПериод.ДатаНачала);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("ОрганизацияОстатков", ТекОрганизацияСписания);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Потребности.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			нПотребность = Потребности.Добавить();
			ЗаполнитьЗначенияСвойств(нПотребность,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Поставщик = ТекОрганизацияСписания.Контрагент;
	Покупатель = ТекОрганизация.Контрагент;
	
	
КонецПроцедуры

&НаКлиенте
Функция Подключаемый_СтраницаОжидания_ЗаполнениеПотребности(Отказ, ПерейтиДалее)
	
	ВыполнитьФормированиеОстатковНаСервере();
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция Подключаемый_СтраницаВыборДоговора_ФормированиеДокументов(Отказ, ПерейтиДалее)
	
	//ВыполнитьФормированиеОстатковНаСервере();
	
	Возврат Неопределено;
	
КонецФункции




&НаКлиенте
Процедура ТаблицаПереходовПоСценарию1()
	
	ТаблицаПереходов.Очистить();
	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 1;
	Переход.ИмяОсновнойСтраницы     = "ГруппаШапкаПотребности1";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииНачало";
	Переход.ИмяСтраницыДекорации    = "СтраницаДекорации";

	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 2;
	Переход.ИмяОсновнойСтраницы     = "СтраницаОжидания";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииОжидание";
	Переход.ИмяСтраницыДекорации    = "СтраницаДекорацииПродолжение";
	Переход.ДлительнаяОперация      = Истина;
	Переход.ИмяОбработчикаДлительнойОперации = "СтраницаОжидания_ЗаполнениеПотребности";

	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 3;
	Переход.ИмяОсновнойСтраницы     = "СтраницаОстатки";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииОжидание";
	Переход.ИмяСтраницыДекорации    = "СтраницаДекорацииПродолжение";
	Переход.ИмяОбработчикаПриПереходеДалее = "СтраницаВыборДоговора_ПриПереходеДалее";

	
	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 4;
	Переход.ИмяОсновнойСтраницы     = "СтраницаВыборДоговора";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииФормированиеДокументов";
	Переход.ИмяСтраницыДекорации    = "СтраницаДекорацииПродолжение";
	Переход.ИмяОбработчикаПриПереходеДалее = "СтраницаФормированиеДокументов_ПриПереходеДалее";

	Переход = ТаблицаПереходов.Добавить();
	Переход.ПорядковыйНомерПерехода = 5;
	Переход.ИмяОсновнойСтраницы     = "СтраницаОкончание";
	Переход.ИмяСтраницыНавигации    = "СтраницаНавигацииОкончание";
	Переход.ИмяСтраницыДекорации    = "СтраницаДекорацииПродолжение";

	Переход.ИмяОбработчикаДлительнойОперации = "Подключаемый_СтраницаВыборДоговора_ФормированиеДокументов";

КонецПроцедуры



&НаСервере
Процедура СохранитьНастройкиФормы()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОписаниеЗакрытия = Новый ОписаниеОповещения("ВыборОрганизаций",ЭтаФорма);
	ОткрытьФорму("Обработка.ТК_МиксерБухУчетТоваров.Форма.ФормаНастройки",Новый Структура("Организации,ТекОрганизацияСписания",мОрганизации,ТекОрганизацияСписания),ЭтаФорма,,,,ОписаниеЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

Процедура ВыборОрганизаций(РезультатВыбора,ДопПараметры)Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мОрганизации.Очистить();
	таблицаЗначений = Новый ТаблицаЗначений;
	таблицаЗначений.Колонки.Добавить("Организация");
	
	Для Каждого Стр Из РезультатВыбора.ТаблицаОрганизации  Цикл 
		Если ЗначениеЗаполнено(Стр.Организация) Тогда
			нСтрока = таблицаЗначений.Добавить();
			нСтрока.Организация = Стр.Организация;
		КонецЕсли;
	КонецЦикла;
	
	мОрганизации.Загрузить(таблицаЗначений);
	ДекорацияТекОрганизацияОстатки = РезультатВыбора.ОрганизацияСписания;
	ТекОрганизацияСписания =  РезультатВыбора.ОрганизацияСписания;;
	ЗаполнитьГраницу(мОрганизации);

	Настройки =Новый Структура;
	Настройки.Вставить("мОрганизации",таблицаЗначений);
	Настройки.Вставить("ОрганизацияСписания",ТекОрганизацияСписания);
	ХранилищаНастроек.НайстройкиФорм.Сохранить(Метаданные.Обработки.ТК_МиксерБухУчетТоваров.Имя,"Миксер",Настройки,,ИмяПользователя());

	
КонецПроцедуры


&НаКлиенте
Процедура мОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура мОрганизацииПриАктивизацииСтроки(Элемент)
	
	ТекСтрока =	Элементы.мОрганизации.ТекущиеДанные;
	ТекОрганизация = ТекСтрока.Организация;
	Элементы.ДекорацияТекОрганизация.Заголовок = Строка(ТекСтрока.Организация);
КонецПроцедуры



&НаКлиенте
Процедура ИзменитьПорядковыйНомерПерехода(Итератор)
	
	ОчиститьСообщения();
	
	УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + Итератор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядковыйНомерПерехода(Знач Значение)
	
	ЭтоПереходДалее = (Значение > ПорядковыйНомерПерехода);
	
	ПорядковыйНомерПерехода = Значение;
	
	Если ПорядковыйНомерПерехода < 0 Тогда
		
		ПорядковыйНомерПерехода = 0;
		
	КонецЕсли;
	
	ПорядковыйНомерПереходаПриИзменении(ЭтоПереходДалее);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПереходаПриИзменении(Знач ЭтоПереходДалее)
	
	// Выполняем обработчики событий перехода.
	ВыполнитьОбработчикиСобытийПерехода(ЭтоПереходДалее);
	
	// Устанавливаем отображение страниц.
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Элементы.ПанельОсновная.ТекущаяСтраница  = Элементы[СтрокаПереходаТекущая.ИмяОсновнойСтраницы];
	Элементы.ПанельНавигации.ТекущаяСтраница = Элементы[СтрокаПереходаТекущая.ИмяСтраницыНавигации];
	
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяСтраницыДекорации) Тогда
		
		Элементы.ПанельДекорации.ТекущаяСтраница = Элементы[СтрокаПереходаТекущая.ИмяСтраницыДекорации];
		
	КонецЕсли;
	
	// Устанавливаем текущую кнопку по умолчанию.
	КнопкаДалее = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаДалее");
	
	Если КнопкаДалее <> Неопределено Тогда
		
		КнопкаДалее.КнопкаПоУмолчанию = Истина;
		
	Иначе
		
		КнопкаГотово = ПолучитьКнопкуФормыПоИмениКоманды(Элементы.ПанельНавигации.ТекущаяСтраница, "КомандаГотово");
		
		Если КнопкаГотово <> Неопределено Тогда
			
			КнопкаГотово.КнопкаПоУмолчанию = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоПереходДалее И СтрокаПереходаТекущая.ДлительнаяОперация Тогда
		
		ПодключитьОбработчикОжидания("ВыполнитьОбработчикДлительнойОперации", 0.1, Истина);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработчикДлительнойОперации()
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	// Обработчик ОбработкаДлительнойОперации.
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПерейтиДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаДлительнойОперации);
		
		Отказ = Ложь;
		ПерейтиДалее = Истина;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПерейтиДалее Тогда
			
			УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Функция ПолучитьКнопкуФормыПоИмениКоманды(ЭлементФормы, ИмяКоманды)
	
	Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			
			ЭлементФормыПоИмениКоманды = ПолучитьКнопкуФормыПоИмениКоманды(Элемент, ИмяКоманды);
			
			Если ЭлементФормыПоИмениКоманды <> Неопределено Тогда
				
				Возврат ЭлементФормыПоИмениКоманды;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(Элемент.ИмяКоманды, ИмяКоманды) > 0 Тогда
			
			Возврат Элемент;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


&НаКлиенте
Процедура ВыполнитьОбработчикиСобытийПерехода(Знач ЭтоПереходДалее)
	
	// Обработчики событий переходов.
	Если ЭтоПереходДалее Тогда
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода - 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеДалее.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеДалее)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеДалее);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СтрокиПерехода = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода + 1));
		
		Если СтрокиПерехода.Количество() > 0 Тогда
			
			СтрокаПерехода = СтрокиПерехода[0];
			
			// Обработчик ПриПереходеНазад.
			Если Не ПустаяСтрока(СтрокаПерехода.ИмяОбработчикаПриПереходеНазад)
				И Не СтрокаПерехода.ДлительнаяОперация Тогда
				
				ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ)";
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПерехода.ИмяОбработчикаПриПереходеНазад);
				
				Отказ = Ложь;
				
				Результат = Вычислить(ИмяПроцедуры);
				
				Если Отказ Тогда
					
					ПорядковыйНомерПерехода = ПорядковыйНомерПерехода + 1;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокиПереходаТекущие = ТаблицаПереходов.НайтиСтроки(Новый Структура("ПорядковыйНомерПерехода", ПорядковыйНомерПерехода));
	
	Если СтрокиПереходаТекущие.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определена страница для отображения.'");
	КонецЕсли;
	
	СтрокаПереходаТекущая = СтрокиПереходаТекущие[0];
	
	Если СтрокаПереходаТекущая.ДлительнаяОперация И Не ЭтоПереходДалее Тогда
		
		УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
		Возврат;
	КонецЕсли;
	
	// обработчик ПриОткрытии
	Если Не ПустаяСтрока(СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии) Тогда
		
		ИмяПроцедуры = "Подключаемый_[ИмяОбработчика](Отказ, ПропуститьСтраницу, ЭтоПереходДалее)";
		ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяОбработчика]", СтрокаПереходаТекущая.ИмяОбработчикаПриОткрытии);
		
		Отказ = Ложь;
		ПропуститьСтраницу = Ложь;
		
		Результат = Вычислить(ИмяПроцедуры);
		
		Если Отказ Тогда
			
			ПорядковыйНомерПерехода = ПорядковыйНомерПерехода - 1;
			Возврат;
			
		ИначеЕсли ПропуститьСтраницу Тогда
			
			Если ЭтоПереходДалее Тогда
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода + 1);
				Возврат;
				
			Иначе
				
				УстановитьПорядковыйНомерПерехода(ПорядковыйНомерПерехода - 1);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Функция Подключаемый_СтраницаВыборДоговора_ПриПереходеДалее(Отказ)
	
	
	мСтрок = Потребности.НайтиСтроки(Новый Структура("Выбран",Истина));
	
	
	Если мСтрок.Количество()=0 Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет товаров для продолжения!");
	КонецЕсли;
	Если НЕ Отказ Тогда
		
		Для Каждого текСтрока Из Потребности Цикл                                 
			Если текСтрока.Выбран И  текСтрока.Потребность>текСтрока.Остаток Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Количество больше чем остаток",, "Потребности["+ Формат(текСтрока.ПолучитьИдентификатор(),"ЧЦ=15; ЧГ=")+"].Потребность");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
		Возврат Неопределено;
		
	КонецФункции


&НаКлиенте
Функция Подключаемый_СтраницаФормированиеДокументов_ПриПереходеДалее(Отказ)
	

	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран поставщик",,"Поставщик",,Отказ);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДоговорПоставщик) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран договор поставщика",,"ДоговорПоставщик",,Отказ);	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Покупатель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран покупатель",,"Покупатель",,Отказ);	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДоговорПокупатель) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран договор покупателя",,"ДоговорПокупатель",,Отказ);	
	КонецЕсли;
	
		
	Возврат Неопределено;
		
КонецФункции



#Область ОбработчикиКомандФормы



&НаКлиенте
Процедура кмДалее(Команда)
	
	Если ПорядковыйНомерПерехода = 1 Тогда
		
		
		НуженВозврат = Ложь;
		Если НЕ ЗначениеЗаполнено(ТекОрганизация) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать организацию из списка",,"ТекОрганизация",,НуженВозврат);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекОрганизацияСписания) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать организацию списания",,"ТекОрганизацияСписания",,НуженВозврат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекОрганизацияСписания) И ЗначениеЗаполнено(ТекОрганизация) И ТекОрганизацияСписания = ТекОрганизация Тогда
			текстСообщениия = "Одинаковая организация с остатками и организация списания,продолжение не возможно"+Символы.ПС+"Укажите другую организацию остатков!";
			ОбщегоНазначенияКлиент.СообщитьПользователю(текстСообщениия,,"ТекОрганизацияСписания",,НуженВозврат);
		КонецЕсли;
		
		Если НуженВозврат Тогда
			Возврат;
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	ИзменитьПорядковыйНомерПерехода(+1);
	
КонецПроцедуры


&НаКлиенте
Процедура кмНачало(Команда)
	ИзменитьПорядковыйНомерПерехода(-(ПорядковыйНомерПерехода-1));
КонецПроцедуры


&НаКлиенте
Процедура кмДалееНачало(Команда)
			
	
	ИзменитьПорядковыйНомерПерехода(+1);

КонецПроцедуры


&НаКлиенте
Процедура кмНазад(Команда)
	ИзменитьПорядковыйНомерПерехода(-1);
КонецПроцедуры

&НаКлиенте
Процедура кмОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура кмГотово(Команда)
	
	ЗакрытьФормуБезусловно = Истина;
	
	Закрыть();

КонецПроцедуры


&НаКлиенте
Процедура ПотребностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСнятьПометки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУстановитьПометки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСнятьФлажки(Пометка)
	
	Для Каждого ВыделеннаяСтрока Из Потребности Цикл
		ВыделеннаяСтрока.Выбран = Пометка;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
